tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
tap "nano-collective/nanocoder", "https://github.com/Nano-Collective/nanocoder"
tap "shopify/shopify"
tap "teamookla/speedtest"
# Run your GitHub Actions locally
brew "act"
# Library for manipulating PNG images
brew "libpng"
# General-purpose data compression with high compression ratio
brew "xz"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# Process Management Interface for HPC environments
brew "pmix"
# High performance message passing library
brew "open-mpi"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# OpenType text shaping engine
brew "harfbuzz"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Framework for layout and rendering of i18n text
brew "pango"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Assuan IPC Library
brew "libassuan"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Library access to GnuPG
brew "gpgme"
# Reliable, high performance TCP/HTTP load balancer
brew "haproxy"
# File format designed to store large amounts of data
brew "hdf5"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# C/C++ seam carving library
brew "liblqr"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6"
# C library for reading and writing MATLAB MAT files
brew "libmatio"
# Postgres C API library
brew "libpq"
# Library to render SVG files using Cairo
brew "librsvg"
# LLVM Project Linker
brew "lld"
# Mac App Store command-line interface
brew "mas"
# Zero-dependency real-time media server and media proxy
brew "mediamtx"
# Deep clean and optimize your Mac
brew "mole"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Platform built on V8 to build network applications
brew "node@14"
# Development kit for the Java programming language
brew "openjdk@17"
# C library to read whole-slide images (a.k.a. virtual slides)
brew "openslide"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Image processing library
brew "vips"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# General-purpose lossless data-compression library
brew "zlib"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Desktop password and login vault
cask "bitwarden"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Free and open-source web browser
cask "chromium"
# Clipboard extension app
cask "clipy"
# Time tracking tool for agencies and freelancers
cask "clockify"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Write, edit, and chat about your code with AI
cask "cursor"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Collaborative meeting agendas, notes, and action items
cask "fellow"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"
# Grammarly for desktop
cask "grammarly-desktop"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# App to manage software development and track bugs
cask "linear"
# Software for Logitech devices
cask "logi-options+"
cask "mqtt-explorer"
# Password manager
cask "nordpass"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Music streaming service
cask "spotify"
# Charting and social-networking for investment traders
cask "tradingview"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Color Picker", id: 1545870783
mas "GIPHY CAPTURE", id: 668208984
mas "Goodnotes", id: 1444383602
mas "Hand Mirror", id: 1502839586
mas "Hidden Bar", id: 1452453066
mas "Home Assistant", id: 1099568401
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Tailscale", id: 1475387142
mas "Telegram", id: 747648890
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "be5invis.vscode-custom-css"
vscode "castwide.solargraph"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "equimper.react-native-react-redux"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hridoy.rails-snippets"
vscode "irongeek.vscode-env"
vscode "janisdd.vscode-edit-csv"
vscode "juanblanco.solidity"
vscode "karunamurti.rspec-snippets"
vscode "kelvin.vscode-sshfs"
vscode "kumar-harsh.graphql-for-vscode"
vscode "mikaelkristiansson87.react-theme-vscode"
vscode "misogi.ruby-rubocop"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "msjsdiag.vscode-react-native"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "qwtel.sqlite-viewer"
vscode "ruby-syntax-tree.vscode-syntax-tree"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.polaris-for-vscode"
vscode "shopify.ruby-lsp"
vscode "shopify.theme-check-vscode"
vscode "simonsiefke.svg-preview"
vscode "sissel.shopify-liquid"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "yoavbls.pretty-ts-errors"
cargo "cargo-expand"
cargo "cargo-llvm-cov"
cargo "cargo-watch"
cargo "rustfmt"
npm "corepack"
