tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
# Library for command-line editing
brew "readline"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Distributed revision control system
brew "git"
# General-purpose data compression with high compression ratio
brew "xz"
# Manage compile and link flags for libraries
brew "pkg-config"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node@14"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Object-relational database system
brew "postgresql@13"
# User interface to the TELNET protocol
brew "telnet"
# General-purpose lossless data-compression library
brew "zlib"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# Manage team projects and tasks
cask "asana"
# Web browser focusing on privacy
cask "brave-browser"
# Remove junk and unused files
cask "ccleaner"
# Productivity platform for tasks, docs, goals, and chat
cask "clickup"
# Clipboard extension app
cask "clipy"
# Time tracking tool for agencies and freelancers
cask "clockify"
# Voice and text chat software
cask "discord"
# Collaborative meeting agendas, notes, and action items
cask "fellow"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Personal blockchain for Ethereum development
cask "ganache"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Interface for reading and syncing eBooks
cask "kindle"
# Screen and video recording software
cask "loom"
# App to write, plan, collaborate, and get organized
cask "notion"
# Free and open source web app scanner
cask "owasp-zap"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Video chat, voice call and instant messaging application
cask "skype"
# Music streaming service
cask "spotify"
# Charting and social-networking for investment traders
cask "tradingview"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Be Focused", id: 973134470
mas "Clocker", id: 1056643111
mas "Hand Mirror", id: 1502839586
mas "Harvest", id: 506189836
mas "Meeter - Partecipare alle riunioni più velocemente", id: 1510445899
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Telegram", id: 747648890
mas "Todoist", id: 585829637
mas "Twitter", id: 1482454543
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
