#Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"

# Brews (packages)
brew "openssl@1.1"
brew "readline"
brew "asdf"
brew "bat"
brew "docker-machine"
brew "fish"
brew "git"
brew "gnupg"
brew "kubernetes-cli"
brew "mas"
brew "minikube"
brew "sqlite"
brew "telnet"
brew "xz"
brew "zlib"
brew "mongodb/brew/mongodb-community"

# Casks (Applications)
cask "appcleaner"
cask "asana"
cask "brave-browser"
cask "ccleaner"
cask "clickup"
cask "clipy"
cask "clockify"
cask "discord"
cask "docker"
cask "figma"
cask "iterm2"
cask "kindle"
cask "loom"
cask "nosqlclient"
cask "notion"
cask "owasp-zap"
cask "postman"
cask "skype"
cask "spectacle"
cask "spotify"
cask "visual-studio-code"
cask "zoom"

# Apps (App Store)
mas "Amphetamine", id: 937984704
mas "Be Focused", id: 973134470
mas "Hand Mirror", id: 1502839586
mas "Meeter - Partecipare alle riunioni più velocemente", id: 1510445899
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Telegram", id: 747648890
mas "Todoist", id: 585829637
mas "Twitter", id: 1482454543
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
